# Module 2 Exercises - Explore Data

### Exercise 1:
Use the pandas library to read in the file "travel-times.csv" as a dataframe. Set the dataframe's variable name as "travel_df".

*Note*: Download the file from [here](https://notebooks.azure.com/priesterkc/projects/DABmaterial/tree/Lv1%20Data%20Analytics/datasets).

In [1]:
#import libraries
import pandas as pd
import numpy as np

In [12]:
location = 'datasets/travel_times.csv'
travel_df = pd.read_csv(location)

### Exercise 2:

Use the pandas library to read in the file "income_expenses.xlsx" as a dataframe. Set the dataframe's variable name as "expense_df".

*Note*: Download the file from [here](https://notebooks.azure.com/priesterkc/projects/DABmaterial/tree/Lv1%20Data%20Analytics/datasets).

In [4]:
location2 = 'datasets/income_expenses.xlsx'
expense_df = pd.read_excel(location2)

### Exercise 3:
Using the lists in the cell below, write code that will zip up the lists and make them into one list, then turn it into a dataframe. Next, export the dataframe as a csv file. Then try exporting the dataframe as an Excel file.

In [5]:
names = ['Nike','Adidas','New Balance','Puma','Reebok']
grades = [176,59,47,38,99]

In [6]:
GradesList = list(zip(names,grades))

In [27]:
df = pd.DataFrame(data = GradesList, columns=['Names', 'Grades'])
df.to_csv('gradelist.csv',index=False,header=False)
writer = pd.ExcelWriter('gradelist.xlsx', engine='xlsxwriter')
df.to_excel(writer, sheet_name = 'Sheet 1')
writer.save()

### Exercise 4:

What columns are in the travel_df dataframe? What columns are in the expense_df dataframe?

In [16]:
travel_df.columns

Index(['Date', 'StartTime', 'DayOfWeek', 'GoingTo', 'Distance', 'MaxSpeed',
       'AvgSpeed', 'AvgMovingSpeed', 'FuelEconomy', 'TotalTime', 'MovingTime',
       'Take407All', 'Comments'],
      dtype='object')

In [17]:
expense_df.columns

Index(['Income Range', 'Category', 'Amount', 'Class_level'], dtype='object')

In [29]:
travel_df.head()

,Date,StartTime,DayOfWeek,GoingTo,Distance,MaxSpeed,AvgSpeed,AvgMovingSpeed,FuelEconomy,TotalTime,MovingTime,Take407All,Comments
0,1/6/2012,16:37,Friday,Home,51.29,127.4,78.3,84.8,NaN,39.3,36.3,No,NaN
1,1/6/2012,08:20,Friday,GSK,51.63,130.3,81.8,88.9,NaN,37.9,34.9,No,NaN
2,1/4/2012,16:17,Wednesday,Home,51.27,127.4,82.0,85.8,NaN,37.5,35.9,No,NaN
3,1/4/2012,07:53,Wednesday,GSK,49.17,132.3,74.2,82.9,NaN,39.8,35.6,No,NaN
4,1/3/2012,18:57,Tuesday,Home,51.15,136.2,83.4,88.1,NaN,36.8,34.8,No,NaN

### Exercise 5:

Using the expense_df dataframe, sum the expense amount using the group_by function by income range.

In [18]:
expense_df.groupby('Income Range').sum()

               Amount
Income Range
$100-200       139.10
$1000+        1125.00
$200-300       249.45
$300-400       335.68
$400-500       433.82
$500-750       557.00
$750-1000      880.00

### Exercise 6:

Using the travel_df dataframe and pivot_table function, get the average total time by day of the week and direction traveled (Home/GSK).

In [30]:
pd.pivot_table(travel_df, values='TotalTime', index=['DayOfWeek', 'GoingTo'])

                   TotalTime
DayOfWeek GoingTo
Friday    GSK      37.628571
          Home     38.238462
Monday    GSK      44.747368
          Home     41.725000
Thursday  GSK      40.204167
          Home     42.345000
Tuesday   GSK      42.079167
          Home     42.962500
Wednesday GSK      42.087500
          Home     44.300000

### Exercise 7:

Choose either the travel_df or expense_df and do some exploratory analysis.

In [21]:
expense_df.describe()

           Amount
count   35.000000
mean   106.287143
std    120.399752
min      0.000000
25%     31.890000
50%     65.070000
75%    152.425000
max    568.130000

In [26]:
expense_df.groupby(['Class_level', 'Income Range']).mean()

                           Amount
Class_level Income Range
Comfortable $500-750      111.400
            $750-1000     176.000
Fair        $300-400       67.136
            $400-500       86.764
Poor        $100-200       27.820
            $200-300       49.890
Well To-Do  $1000+        225.000